var provinceArr = [];
provinceArr[0] = ['上海'];
provinceArr[1] = ['广东'];
provinceArr[2] = ['黑龙江'];
provinceArr[3] = ['四川'];
provinceArr[4] = ['陕西'];
provinceArr[5] = ['内蒙古'];
provinceArr[6] = ['福建'];
provinceArr[7] = ['北京'];
provinceArr[8] = ['天津'];
provinceArr[9] = ['甘肃'];
provinceArr[10] = ['河南'];
provinceArr[11] = ['江西'];
provinceArr[12] = ['山东'];
provinceArr[13] = ['浙江'];
provinceArr[14] = ['台湾'];
provinceArr[15] = ['江苏'];
provinceArr[16] = ['重庆'];
provinceArr[17] = ['香港'];
provinceArr[18] = ['湖南'];
provinceArr[19] = ['河北'];
provinceArr[20] = ['安徽'];
provinceArr[21] = ['新疆'];
provinceArr[22] = ['辽宁'];
provinceArr[23] = ['广西'];
provinceArr[24] = ['山西'];
provinceArr[25] = ['云南'];
provinceArr[26] = ['湖北'];
provinceArr[27] = ['海南'];
provinceArr[28] = ['吉林'];
provinceArr[29] = ['贵州'];
provinceArr[30] = ['宁夏'];
provinceArr[31] = ['澳门'];
provinceArr[32] = ['青海'];
provinceArr[33] = ['西藏'];
var cityArr = [];
cityArr[0] = ['上海','境外输入','外地来沪','浦东','宝山','闵行','徐汇','静安','松江','长宁','普陀','奉贤','嘉定','杨浦','虹口','青浦','黄浦','金山','崇明','境外来沪','未明确地区','境外输入人员','浦东新区','闸北','待确认',];
cityArr[1] = ['广东','境外输入','深圳','广州','东莞','珠海','佛山','中山','惠州','汕头','江门','湛江','肇庆','梅州','阳江','茂名','清远','韶关','揭阳','汕尾','河源','潮州','云浮','未明确地区','境外输入人员',];
cityArr[2] = ['黑龙江','境外输入','哈尔滨','双鸭山','绥化','鸡西','齐齐哈尔','牡丹江','大庆','黑河','七台河','佳木斯','鹤岗','大兴安岭','未明确地区','伊春','境外输入人员','待确认',];
cityArr[3] = ['四川','境外输入','成都','甘孜','达州','南充','广安','泸州','巴中','绵阳','内江','德阳','遂宁','攀枝花','凉山','宜宾','自贡','雅安','眉山','广元','资阳','乐山','阿坝','甘孜州','阿坝州','未明确地区','境外输入人员',];
cityArr[4] = ['陕西','境外输入','西安','汉中','安康','咸阳','渭南','宝鸡','铜川','延安','商洛','榆林','韩城','杨凌','未明确地区','杨凌示范区','韩城市','境外输入人员',];
cityArr[5] = ['内蒙古','境外输入','呼伦贝尔','鄂尔多斯','包头','赤峰','锡林郭勒','巴彦淖尔','通辽','呼和浩特','乌兰察布','乌海','兴安盟','境外输入人员','未明确地区','阿拉善盟','锡林郭勒盟',];
cityArr[6] = ['福建','境外输入','福州','莆田','泉州','厦门','宁德','南平','漳州','三明','龙岩','未明确地区','境外输入人员',];
cityArr[7] = ['北京','丰台','境外输入','大兴','海淀','朝阳','西城','顺义','昌平','外地来京','通州','房山','东城','石景山','怀柔','密云','未明确地区','门头沟','延庆','平谷','境外输入人员','大兴区',];
cityArr[8] = ['天津','境外输入','天津本土','宝坻区','河东区','滨海新区','河北区','北辰区','外地来津','南开区','和平区','河西区','东丽区','西青区','宁河区','津南区','红桥区','武清区','河东','河西','南开','河北','和平','红桥','北辰','武清','宝坻','东丽','西青','津南','境外输入人员','静海县','蓟县','未明确地区',];
cityArr[9] = ['甘肃','境外输入','兰州','天水','定西','平凉','甘南州','白银','陇南','临夏','庆阳','张掖','金昌','酒泉','嘉峪关','未明确地区','武威','境外输入人员','甘南',];
cityArr[10] = ['河南','信阳','郑州','南阳','驻马店','商丘','周口','平顶山','新乡','安阳','许昌','漯河','焦作','洛阳','开封','境外输入','鹤壁','濮阳','三门峡','济源示范区','济源','境外输入人员','未明确地区',];
cityArr[11] = ['江西','南昌','新余','上饶','九江','宜春','赣州','抚州','萍乡','吉安','鹰潭','景德镇','境外输入','赣江新区','境外输入人员','未明确地区',];
cityArr[12] = ['山东','济宁','境外输入','青岛','临沂','烟台','济南','潍坊','聊城','威海','德州','泰安','淄博','枣庄','菏泽','日照','滨州','东营','任城监狱','未明确地区','境外输入人员','莱芜',];
cityArr[13] = ['浙江','温州','杭州','宁波','台州','境外输入','金华','嘉兴','绍兴','省十里丰监狱','丽水','衢州','湖州','舟山','境外输入人员','划归外省','未明确地区',];
cityArr[14] = ['台湾','未明确地区',];
cityArr[15] = ['江苏','南京','苏州','徐州','淮安','无锡','境外输入','常州','连云港','南通','泰州','盐城','扬州','宿迁','镇江','境外输入人员','未明确地区',];
cityArr[16] = ['重庆','万州区','江北区','云阳县','綦江区','合川区','长寿区','奉节县','忠县','开州区','九龙坡区','渝中区','垫江县','潼南区','渝北区','两江新区','石柱县','南岸区','境外输入','巫溪县','大足区','丰都县','铜梁区','巫山县','璧山区','荣昌区','沙坪坝区','大渡口区','巴南区','涪陵区','永川区','江津区','梁平区','高新区','黔江区','城口县','彭水县','武隆区','万盛经开区','酉阳县','秀山县','未明确地区','开州','境外输入人员','开县','永川','合川','江津','长寿','南川','九龙坡','沙坪坝','江北','北碚','南岸','綦江','黔江','巴南','渝北','大足','渝中','涪陵','万州',];
cityArr[17] = ['香港','未明确地区',];
cityArr[18] = ['湖南','长沙','岳阳','邵阳','常德','株洲','娄底','益阳','衡阳','永州','怀化','郴州','湘潭','湘西自治州','张家界','境外输入','境外输入人员','未明确地区',];
cityArr[19] = ['河北','唐山','沧州','保定','张家口','境外输入','石家庄','廊坊','邯郸','邢台','秦皇岛','衡水','承德','未明确地区','境外输入人员','地市待确认','待确认','地区待确诊','地区待确定',];
cityArr[20] = ['安徽','合肥','蚌埠','阜阳','亳州','安庆','六安','宿州','马鞍山','芜湖','铜陵','淮南','淮北','池州','滁州','黄山','宣城','境外输入','境外输入人员','未明确地区',];
cityArr[21] = ['新疆','乌鲁木齐','喀什','伊犁州','兵团第四师','昌吉州','第八师石河子','兵团第九师','吐鲁番','兵团第十二师','巴州','六师五家渠','阿克苏','第七师','未明确地区','兵团第六师五家渠市','阿拉尔','阿勒泰','和田','博尔塔拉蒙古自治州','塔城','哈密','图木舒克','兵团第八师石河子市','兵团第七师','克拉玛依','克孜勒苏柯尔克孜自治州',];
cityArr[22] = ['辽宁','大连','境外输入','沈阳','锦州','葫芦岛','丹东','盘锦','阜新','铁岭','朝阳市','鞍山','本溪','辽阳','营口','抚顺','朝阳','境外输入人员','未明确地区',];
cityArr[23] = ['广西','南宁','北海','桂林','河池','柳州','防城港','境外输入','玉林','来宾','贵港','钦州','梧州','贺州','百色','境外输入人员','未明确地区','崇左',];
cityArr[24] = ['山西','境外输入','晋中','太原','运城','大同','晋城','长治','朔州','忻州','吕梁','阳泉','临汾','未明确地区','境外输入人员',];
cityArr[25] = ['云南','境外输入','昆明','昭通市','西双版纳州','玉溪','大理','曲靖','红河','保山市','丽江市','德宏州','普洱','楚雄州','文山州','临沧','丽江','德宏','楚雄','迪庆藏族自治州','保山','未明确地区','境外输入人员','怒江傈僳族自治州','西双版纳','昭通',];
cityArr[26] = ['湖北','武汉','孝感','黄冈','荆州','鄂州','随州','襄阳','黄石','宜昌','荆门','咸宁','十堰','仙桃','天门','恩施州','潜江','境外输入','神农架','境外输入人员','监狱系统','未明确地区','神农架林区',];
cityArr[27] = ['海南','三亚','海口','儋州','万宁','澄迈县','昌江县','琼海','临高县','陵水县','文昌','东方','定安县','保亭','乐东','境外输入','琼中县','白沙黎族自治县','保亭县','西沙群岛','未明确地区','中沙群岛的岛礁及其海域','屯昌县','五指山','昌江','陵水','南沙群岛','境外输入人员',];
cityArr[28] = ['吉林','吉林','长春','境外输入','四平','辽源','通化','公主岭','延边','松原','白城','梅河口市','白山','未明确地区','梅河口','境外输入人员','长春市','通化市',];
cityArr[29] = ['贵州','贵阳','遵义','毕节','黔南州','黔东南州','六盘水','铜仁','黔西南州','安顺','境外输入','境外输入人员','未明确地区',];
cityArr[30] = ['宁夏','银川','吴忠','固原','中卫','境外输入','石嘴山','宁东管委会','宁东','未明确地区',];
cityArr[31] = ['澳门','未明确地区',];
cityArr[32] = ['青海','西宁','海北州','未明确地区',];
cityArr[33] = ['西藏','拉萨','未明确地区',];

    function getCity()
    {
        //1.获取省份选择框的对象
        var provincesobj=document.getElementById("province");
        //2.获取市区选择框的对象
        var cityobj=document.getElementById("city");
        //3.获取被选择的省份的索引
        var index=provincesobj.selectedIndex;
        //alert(provincesobj[index].value+","+provincesobj[index].text);
        ////4.通过省份的索引获取它的value值，value值也是它在数组的索引值
        var value=provincesobj[index].value;
        //5.获取对应省份的市区数组
        var cityName=cityArr[value];
        //6.将下拉框清除索引为0之后的，只保留第一个
        cityobj.length=1;
        //通过循环遍历市县元素给下拉框赋值
        for(var i=1;i<cityArr[value].length;i++)
        {
            cityobj.options[cityobj.options.length]=new Option(cityName[i],cityName[i]);
        }
    }
